Revit 2024 API
ExternalResourceBrowserData.GetMatchOptions Method
 Gets the match options used to filter external resources.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceMatchOptions GetMatchOptions()
Visual Basic
Public Function GetMatchOptions As ExternalResourceMatchOptions
Visual C++
public:
ExternalResourceMatchOptions^ GetMatchOptions()
Return Value
 The external resource match options.
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace